[
  {
    "image": "https://i.ibb.co.com/sJ1CSwft/coconut-tree.png",
    "title": "Learn Spanish Fast",
    "companyName": "LingoMasters Inc.",
    "id": 101,
    "description": "Unlock the power of conversational Spanish with **LingoMasters Inc.'s** flagship application, **Learn Spanish Fast**. This comprehensive platform is engineered for rapid language acquisition, moving beyond rote memorization to immerse you in practical, real-world dialogue. The curriculum is structured into **15 progressive tiers**, starting with foundational vocabulary and grammar essentials and scaling up to complex sentence structures and idiomatic expressions necessary for fluent conversation. Our unique, **AI-driven adaptive learning engine** customizes the pace and content of lessons based on your individual performance, ensuring you spend time mastering areas where you struggle and efficiently reinforcing what you already know. Key features include **native speaker audio** for precise pronunciation practice, **interactive voice-recording exercises** that provide instant feedback on accent, and **gamified lessons** that make daily study a rewarding experience. The app also boasts a massive, constantly updated library of cultural context notes, travel phrases, and business Spanish modules. You can engage with **live-streamed tutoring sessions** with certified instructors and participate in **peer-to-peer conversation exchange forums**. The entire core content is accessible **offline**, allowing seamless learning whether you're commuting, traveling, or simply away from Wi-Fi. We focus intensely on four crucial language skills: **listening comprehension, reading fluency, written accuracy, and confident speaking**. Our extensive **flashcard system** uses spaced repetition to cement vocabulary deep into your long-term memory. With millions of satisfied learners globally, Learn Spanish Fast offers a robust, enjoyable, and proven path to achieving fluency in Spanish. Start your journey today and connect with over **550,000 global downloaders** who rate this app an outstanding 4.7 for its effectiveness and quality.",
    "size": 75,
    "reviews": 12450,
    "ratingAvg": 4.7,
    "downloads": 550000,
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 200 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 7650 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/sJ1CSwft/coconut-tree.png",
    "title": "Astro Guide Pro",
    "companyName": "StarGazer Apps",
    "id": 102,
    "description": "Transform your device into a powerful portable observatory with **Astro Guide Pro**, the premier application for amateur astronomers and curious stargazers alike. This app uses augmented reality (AR) to map the stars, planets, constellations, and deep-sky objects visible from your exact location in real-time. Simply point your camera to the night sky, and watch as names, pathways, and stunning 3D models overlay the actual celestial bodies, making identification effortless and magical. Our vast, constantly updated database includes **over 100,000 stars**, every major planet and moon, and thousands of nebulas, galaxies, and star clusters. The app provides detailed information on each object, including its distance, composition, history, and mythology. Never miss an event with our **customizable celestial calendar**, which alerts you to meteor showers, planetary alignments, eclipses, and visible satellite passes. Features like **Time Travel mode** allow you to fast-forward or rewind the sky up to 100 years, helping you plan future viewing sessions or see the stars as they appeared in the past. Use the **Night Vision filter** to protect your dark adaptation while observing. Astro Guide Pro includes integrated links to live feed images from major telescopes and daily astronomical news updates. Whether you're tracking the phases of the moon, locating Mars, or identifying the Andromeda Galaxy, Astro Guide Pro is your essential companion to exploring the cosmos. Join our community of over **210,000 celestial enthusiasts** and start your cosmic journey today.",
    "size": 150,
    "reviews": 8900,
    "ratingAvg": 4.5,
    "downloads": 210000,
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 150 },
      { "name": "3 star", "count": 700 },
      { "name": "4 star", "count": 3000 },
      { "name": "5 star", "count": 5000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/sJ1CSwft/coconut-tree.png",
    "title": "Pocket Budgeter",
    "companyName": "FinanceGenius LLC",
    "id": 103,
    "description": "**Pocket Budgeter** is the smart, seamless, and secure way to master your money. This comprehensive financial management app connects securely to all your bank accounts and credit cards, providing a crystal-clear, real-time snapshot of your entire financial life. Stop guessing where your money goes; the app automatically categorizes every transaction, giving you powerful insight into your spending habits. Our award-winning **Zero-Based Budgeting (ZBB)** system ensures every dollar has a job, guiding you toward financial discipline and freedom. Easily set spending limits for groceries, entertainment, bills, and more, and receive **customizable alerts** before you overspend in any category. The app specializes in future-proofing your finances with tools like the **Debt Snowball Calculator** to accelerate loan payoff and a **Goal Tracker** to visualize and fund your dreams, from a down payment to retirement. Key features include: multi-currency support for international users, secure offline access, and detailed reporting with visual charts that simplify complex data. **Pocket Budgeter** is committed to security, using bank-grade encryption to protect your sensitive information. Take the stress out of money management. Join our thriving community of over **1.5 million users** who are confidently saving more, spending smarter, and building a secure future. Download Pocket Budgeter and start your journey to financial peace today. This is the only tool you need to transform your financial habits permanently.",
    "size": 45,
    "reviews": 35600,
    "ratingAvg": 4.8,
    "downloads": 1500000,
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 8000 },
      { "name": "5 star", "count": 24900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/sJ1CSwft/coconut-tree.png",
    "title": "Gourmet Recipes",
    "companyName": "CookUp Software",
    "id": 104,
    "description": "Unlock your inner chef with **Gourmet Recipes**, the definitive culinary application featuring a global collection of dishes for every skill level and occasion. Our library is home to **over 50,000 meticulously tested recipes**, ranging from quick weeknight meals and healthy plant-based options to complex fine-dining techniques. Finding the perfect dish is effortless with our **smart filtering system**; search by ingredient, cuisine (e.g., Thai, Mediterranean, Italian), preparation time, dietary restrictions (keto, gluten-free, vegan), or even the utensils you have available. A revolutionary feature is the **'Pantry Check'**, which scans your inventory and suggests recipes you can make *right now*, minimizing food waste and saving trips to the store. Every recipe includes stunning, high-definition photography, step-by-step video tutorials, and clearly written instructions with integrated voice narration to keep your hands clean while cooking. Easily adjust serving sizes, and the app will instantly calculate the precise ingredient quantities. Save your favorites, create personalized cookbooks, and use the integrated **Smart Shopping List** that organizes ingredients by grocery store aisle. Whether you're a beginner learning to boil an egg or a seasoned cook looking for Michelin-star inspiration, **Gourmet Recipes** turns every meal preparation into a delightful and successful culinary adventure. Join our community of food lovers and start exploring your next favorite dish tonight.",
    "size": 90,
    "reviews": 22100,
    "ratingAvg": 4.6,
    "downloads": 750000,
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 14000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/sJ1CSwft/coconut-tree.png",
    "title": "Zen Block Puzzle",
    "companyName": "MindGames Studios",
    "id": 105,
    "description": "Escape the chaos of the day and find your flow state with **Zen Block Puzzle**, the minimalist twist on the classic block-stacking game. Designed not just to challenge your mind but to soothe your senses, this game combines satisfying spatial logic puzzles with tranquil aesthetics. The objective is simple: drag and drop colorful wooden blocks onto a 10x10 grid to create and clear full horizontal or vertical lines. The key difference is the absence of time limits or penalties for slow play—you can relax and strategize at your own pace. **Zen Block Puzzle** features a stunning, nature-inspired visual design, with calming color palettes and ambient, lo-fi soundtracks that provide the perfect background for focused concentration. It’s the ideal mental workout to boost your cognitive function, spatial reasoning, and problem-solving skills without the high-pressure stress of traditional arcade games. We offer multiple soothing modes, including **Classic Grid**, a **Daily Challenge** to keep your mind sharp, and an **Endless Zen Mode** for pure relaxation. Track your high scores and compete on global leaderboards, or simply play for the meditative benefit of a clean, cleared board. Perfect for a mindful break during your commute or a relaxing wind-down before bed. With over **5 million worldwide downloads**, players praise its addictive gameplay and its unique ability to calm the mind. Download **Zen Block Puzzle** and discover the peaceful side of challenging puzzle games.",
    "size": 60,
    "reviews": 98000,
    "ratingAvg": 4.4,
    "downloads": 5000000,
    "ratings": [
      { "name": "1 star", "count": 1000 },
      { "name": "2 star", "count": 2500 },
      { "name": "3 star", "count": 7500 },
      { "name": "4 star", "count": 30000 },
      { "name": "5 star", "count": 57000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/sJ1CSwft/coconut-tree.png",
    "title": "Calm Space",
    "companyName": "InnerPeace Apps",
    "id": 106,
    "description": "Find your inner quiet and unlock a path to deeper sleep with **Calm Space**, the world-class app for guided meditation, mindfulness, and sleep optimization. Designed by leading mental wellness experts, our vast library of content helps you manage stress, reduce anxiety, improve focus, and develop better emotional resilience. Start your journey with our foundational **Mindfulness Courses**, or explore topic-specific single sessions for everything from panic relief to cultivating gratitude. When daylight fades, **Calm Space** seamlessly transitions to your ultimate sleep aid. Our renowned **Sleep Stories** feature tranquil narratives and calming voices to gently distract your mind and escort you into slumber. Choose from a massive collection of premium **Ambient Soundscapes** (like forest rain, ocean waves, and white noise), or utilize our guided **Body Scan Meditations** to physically relax every muscle from head to toe. The app features a personalized **Mood Tracker** and an integrated **Breathing Coach** to help you regulate your nervous system on demand. With a stunning 4.9 average rating from over **3.2 million users**, Calm Space is globally recognized as the most effective tool for promoting mental health and restorative rest. Invest in your well-being, improve your focus, and start enjoying the profound benefits of quality sleep. Download **Calm Space** today and discover the stillness within.",
    "size": 180,
    "reviews": 55200,
    "ratingAvg": 4.9,
    "downloads": 3200000,
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 100 },
      { "name": "3 star", "count": 500 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 49500 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/sJ1CSwft/coconut-tree.png",
    "title": "Home Fit Trainer",
    "companyName": "HealthTech Solutions",
    "id": 107,
    "description": "Turn your living room into a high-performance gym with **Home Fit Trainer**, your comprehensive solution for achieving fitness goals without leaving the house. This app is designed for everyone, from absolute beginners to seasoned athletes, requiring minimal to zero equipment. Our platform hosts **thousands of HD video-guided workouts** led by certified professional trainers. We offer diverse categories including **HIIT**, Strength Training, Yoga, Dance Cardio, Pilates, and targeted body-area routines (Abs, Legs, Upper Body). Simply set your goal—weight loss, muscle gain, endurance, or flexibility—and our **AI-powered scheduling tool** will create a personalized 4 to 12-week training plan perfectly tailored to your current fitness level and available time. The app features integrated tracking tools to log your progress, measure calories burned, and celebrate milestones, keeping your motivation high. The workout experience is seamless with integrated rest timers, clear audible cues, and form correction guidance. A standout feature is the **'Workout Blender'**, which allows you to customize and combine segments from your favorite routines to create your own unique session. You can also cast any workout to your smart TV for a full-screen experience. Stop paying for expensive gym memberships and join the over **1.9 million users** transforming their bodies with the convenience and quality of **Home Fit Trainer**. Start your free trial today and discover a healthier, stronger you.",
    "size": 120,
    "reviews": 41800,
    "ratingAvg": 4.7,
    "downloads": 1900000,
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 10000 },
      { "name": "5 star", "count": 29500 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/sJ1CSwft/coconut-tree.png",
    "title": "QuickEdit Photo Studio",
    "companyName": "PixelPerfect Software",
    "id": 108,
    "description": "Unleash the full potential of your mobile photos and videos with **QuickEdit Photo Studio**, the powerful, yet easy-to-use, all-in-one creative suite. Designed for both quick touch-ups and professional-grade editing, this app provides desktop-level tools right on your phone. For photos, the app boasts an extensive array of filters, one-tap enhancements, and precise adjustment tools for exposure, saturation, and white balance. Core features include the **AI Object Removal** tool to instantly erase unwanted elements from your shots and sophisticated **Layer Editing** capabilities for complex compositions. The video editing component is equally robust, offering essential functions like trimming, merging, and cropping clips. Elevate your footage with our library of **cinematic transitions**, custom text overlays, and a royalty-free music library. A unique selling point is the powerful **Color Grading Suite**, allowing users to fine-tune shadows, midtones, and highlights with professional-grade color wheels. Export your creations in high-resolution (up to 4K) directly to all major social media platforms. Whether you're a content creator, a social media influencer, or just someone who loves great pictures, **QuickEdit Photo Studio** offers the speed and flexibility you need. Its intuitive interface ensures a smooth workflow, transforming hours of editing work into minutes. Join over **4 million users** who trust QuickEdit to make every pixel perfect.",
    "size": 110,
    "reviews": 78900,
    "ratingAvg": 4.3,
    "downloads": 4000000,
    "ratings": [
      { "name": "1 star", "count": 2000 },
      { "name": "2 star", "count": 3000 },
      { "name": "3 star", "count": 8000 },
      { "name": "4 star", "count": 25000 },
      { "name": "5 star", "count": 40900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/sJ1CSwft/coconut-tree.png",
    "title": "Global Weather Now",
    "companyName": "Forecast Dynamics",
    "id": 109,
    "description": "Stay ahead of every shift in the sky with **Global Weather Now**, the fastest and most accurate real-time weather application available. Leveraging cutting-edge 'nowcasting' technology and high-resolution radar, we provide street-level weather updates that tell you exactly when the rain or snow will start and stop at your location. Our data is sourced from multiple world meteorological organizations and proprietary satellite feeds, ensuring unparalleled accuracy across the globe. The app features a stunning, easy-to-read interface that instantly displays the current temperature, wind speed, humidity, and atmospheric pressure. Dive deeper into our **10-day hourly forecasts** to plan your week with confidence. A critical feature is the **Severe Weather Alert System**, which delivers instant, customizable push notifications for extreme events like thunderstorms, hurricanes, and blizzards, keeping you and your family safe. Our interactive, full-screen **High-Definition Radar Map** allows you to track storms in motion, view future precipitation, and check air quality and pollen levels. You can save multiple locations—perfect for tracking family, friends, or your travel destinations. Trusted by over **9 million users** worldwide for its reliability and speed, **Global Weather Now** is more than just a forecast; it’s your indispensable daily weather companion. Download today and experience the certainty of superior meteorological prediction.",
    "size": 30,
    "reviews": 65000,
    "ratingAvg": 4.5,
    "downloads": 9000000,
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 5000 },
      { "name": "4 star", "count": 20000 },
      { "name": "5 star", "count": 38500 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/sJ1CSwft/coconut-tree.png",
    "title": "Age of Titans",
    "companyName": "EpicGames Inc.",
    "id": 110,
    "description": "Command mighty armies and conquer the world in **Age of Titans**, the ultimate massively multiplayer online (MMO) strategy game. This title thrusts you into a deep medieval fantasy world where strategic planning, resource management, and tactical combat are the keys to victory. Start with a humble settlement and quickly expand it into a fortified empire by gathering vital resources, researching new technologies, and training various military units—from knights and archers to mythical giants. The core gameplay revolves around real-time player-versus-player (PvP) conflicts. Form powerful alliances with players globally to coordinate massive siege warfare attacks against rival kingdoms. Our vast game world features dynamically shifting territories, making political strategy and negotiation just as important as brute military strength. **Age of Titans** features stunning 3D graphics, bringing epic battlefield clashes and intricately designed cities to life on your mobile device. Participate in **weekly server-wide events** to earn legendary artifacts and powerful hero units that can turn the tide of any battle. The game offers a deep tech tree, allowing for highly specialized kingdom development. Join over **12 million strategic commanders** who are vying for the throne. Download **Age of Titans** now, raise your banner, and prove your military and political genius to etch your name into the history of the realm!",
    "size": 450,
    "reviews": 150000,
    "ratingAvg": 4.2,
    "downloads": 12000000,
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 17000 },
      { "name": "4 star", "count": 45000 },
      { "name": "5 star", "count": 75000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/sJ1CSwft/coconut-tree.png",
    "title": "Simple Notes Plus",
    "companyName": "Productivity Tools Ltd.",
    "id": 111,
    "description": "Experience the joy of clutter-free note-taking with **Simple Notes Plus**, the intuitive app designed for maximum speed and efficiency. Unlike bloated applications, Simple Notes Plus focuses on providing a lightning-fast, minimalist interface that gets out of your way, allowing you to capture ideas, lists, and information the moment inspiration strikes. Key features include **one-tap checklist creation** for instant to-do lists, shopping lists, or project outlines, and easy color-coding to quickly prioritize and categorize your notes at a glance. All notes are instantly and securely synced to the cloud, ensuring you never lose a vital thought and can access your data seamlessly across all your devices. The powerful, yet simple, search function uses full-text indexing to locate any note, no matter how old, in a fraction of a second. Security is paramount; you can lock sensitive notes using a PIN or fingerprint scanner. The app supports rich text formatting for clear document structuring without unnecessary complexity. Whether you're a student jotting down lecture points, a professional managing quick memos, or just organizing your personal life, **Simple Notes Plus** is your essential digital companion for streamlined productivity. Its small size and high efficiency make it a favorite among those who value simplicity and speed. Download today and declutter your digital life.",
    "size": 25,
    "reviews": 19000,
    "ratingAvg": 4.6,
    "downloads": 1100000,
    "ratings": [
      { "name": "1 star", "count": 150 },
      { "name": "2 star", "count": 250 },
      { "name": "3 star", "count": 1100 },
      { "name": "4 star", "count": 6500 },
      { "name": "5 star", "count": 11000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/sJ1CSwft/coconut-tree.png",
    "title": "Movie Maker Pro",
    "companyName": "ClipCut Studios",
    "id": 112,
    "description": "Unleash your inner filmmaker with **Movie Maker Pro**, the intuitive and powerful mobile video editing application that puts professional-grade tools in the palm of your hand. Designed for content creators, vloggers, and social media enthusiasts, this app allows you to create stunning, high-definition videos with ease. Core features include a multi-track timeline for precise editing, powerful tools for trimming, splitting, and merging video clips, and an integrated library of dynamic transitions and cinematic effects. Elevate your storytelling with custom text overlays, animated titles, and a massive selection of stickers and emojis. **Movie Maker Pro** gives you unparalleled audio control with multi-layer sound mixing, voiceover recording, and a curated library of royalty-free music and sound effects. Advanced features include **Chroma Key (Green Screen) support** for creating complex visual effects, speed control for silky-smooth slow-motion or dramatic fast-forward sequences, and keyframe animation for dynamic movement of text and stickers. Easily adjust color and lighting with professional filters and grading tools. The app supports export resolutions up to 4K, ensuring your videos look crisp and clean when shared across YouTube, TikTok, and Instagram. Join over **2.5 million creators** who rely on Movie Maker Pro for fast, high-quality video production. Download now and start transforming your raw footage into polished masterpieces.",
    "size": 220,
    "reviews": 33000,
    "ratingAvg": 4.4,
    "downloads": 2500000,
    "ratings": [
      { "name": "1 star", "count": 1000 },
      { "name": "2 star", "count": 1500 },
      { "name": "3 star", "count": 3500 },
      { "name": "4 star", "count": 9000 },
      { "name": "5 star", "count": 18000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/sJ1CSwft/coconut-tree.png",
    "title": "Alphabet Zoo",
    "companyName": "EduKids Games",
    "id": 113,
    "description": "Make learning fun and interactive with **Alphabet Zoo**, the enchanting educational game designed for toddlers and preschoolers (ages 2-6). This app transforms the fundamentals of early literacy—letters, numbers, and basic phonics—into a joyful, animal-themed adventure. Kids will explore a beautifully animated zoo where each enclosure features a game focused on a specific learning objective. The curriculum includes **Tracing Exercises** for developing fine motor skills and handwriting proficiency, engaging **Phonics Puzzles** to connect letters with their sounds, and **Early Word Recognition** games that use sight words and friendly animal illustrations. The app focuses intensely on the 26 letters of the English alphabet, teaching both uppercase and lowercase forms through colorful, reward-based activities that keep children motivated. Our content is fully narrated by professional child voice actors, providing clear pronunciation and guidance. The interface is 100% kid-safe, with no third-party ads or external links in the main play areas, ensuring a secure and uninterrupted learning environment. Parents can track their child's progress through a dedicated, password-protected dashboard, monitoring time spent and skills mastered. Trusted by educators and loved by over **800,000 parents**, **Alphabet Zoo** provides a solid, entertaining foundation for school success. Download today and watch your child fall in love with learning!",
    "size": 180,
    "reviews": 15500,
    "ratingAvg": 4.8,
    "downloads": 800000,
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 100 },
      { "name": "3 star", "count": 400 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 11450 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/sJ1CSwft/coconut-tree.png",
    "title": "PDF Reader & Editor",
    "companyName": "DocumentFlow Inc.",
    "id": 114,
    "description": "Manage, annotate, and edit your documents with unparalleled ease using **PDF Reader & Editor**, the essential tool for students and business professionals. This all-in-one app provides robust functionality to handle any PDF task right from your mobile device. Our reader delivers a smooth, fast viewing experience, even with massive, complex documents, offering features like continuous scroll, night mode, and customizable zoom. The editor capabilities transform how you interact with portable document formats. Easily **highlight, underline, and strikeout text**, add sticky notes, and freehand draw directly onto documents. Crucially, the app features powerful tools for **filling out forms and legally signing documents** using your finger or stylus, eliminating the need for printing and scanning. You can also organize PDFs by merging multiple files into one, splitting large documents, or rearranging, rotating, and deleting pages. The app supports cloud synchronization with Google Drive, Dropbox, and OneDrive for seamless file access and backup. **PDF Reader & Editor** is your solution for a paperless workflow, offering high security and password protection for sensitive files. Join our base of over **6 million users** who rely on this app for reliable, efficient document management. Download now and turn your mobile device into a complete document center.",
    "size": 55,
    "reviews": 50000,
    "ratingAvg": 4.5,
    "downloads": 6000000,
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 1300 },
      { "name": "3 star", "count": 4000 },
      { "name": "4 star", "count": 15000 },
      { "name": "5 star", "count": 29000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/sJ1CSwft/coconut-tree.png",
    "title": "Wanderlust Planner",
    "companyName": "Global Nomad Tools",
    "id": 115,
    "description": "Plan the perfect trip without the stress using **Wanderlust Planner**, the definitive itinerary and travel management app for the modern explorer. Stop juggling spreadsheets, printouts, and multiple booking confirmations. This app centralizes all your travel data into one beautiful, easy-to-use digital itinerary. Simply forward your flight, hotel, car rental, and activity confirmation emails to your unique Wanderlust address, and the app automatically parses the data, building a detailed, organized timeline for your trip. Key features include **real-time flight status alerts**, gate change notifications, and integrated map views for navigation between points of interest. You can easily drag and drop activities to optimize your daily schedule, add notes for reservations, and save local attractions. A critical feature for international travel is **offline access** to your entire itinerary, maps, and important documents, ensuring you are never stranded without information. Collaborate effortlessly by sharing the itinerary with your travel companions, allowing everyone to contribute and stay updated on changes. The app also offers curated city guides and lists of local favorites suggested by other global nomads. Trusted by hundreds of thousands for its reliability and convenience, **Wanderlust Planner** transforms trip planning from a chore into an exciting part of the adventure. Download today and start building the vacation of a lifetime.",
    "size": 85,
    "reviews": 11200,
    "ratingAvg": 4.7,
    "downloads": 450000,
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 6000 },
      { "name": "4 star", "count": 3400 },
      { "name": "5 star", "count": 7000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/sJ1CSwft/coconut-tree.png",
    "title": "Audio Stream Max",
    "companyName": "SoundWave Technologies",
    "id": 116,
    "description": "Dive into an infinite ocean of sound with **Audio Stream Max**, the ultimate music and podcast streaming platform offering a library of **over 100 million songs** and thousands of exclusive podcasts. Built for true audiophiles, the app streams in high-fidelity (Hi-Fi) quality, ensuring every note is delivered with pristine clarity and depth. Our powerful **AI-driven recommendation engine** learns your unique tastes after just a few plays, creating personalized daily mixes, weekly discovery playlists, and tailored radio stations that constantly introduce you to new favorites. Go beyond passive listening by utilizing our innovative **Social Jams feature**, which allows you to create real-time listening parties with friends anywhere in the world. Key features include **fully functional offline listening** for your saved playlists and albums, customizable EQ settings to fine-tune your sound profile, and seamless integration with all smart speakers and car audio systems. The podcast library offers exclusive content, adjustable playback speed, and an intelligent feature that automatically removes silence and filler words for more efficient listening. **Audio Stream Max** is compatible with both free (ad-supported) and premium (ad-free with Hi-Fi and unlimited skips) subscription tiers. Join a community of over **15 million passionate listeners** who choose us for superior sound quality and unmatched content depth. Download today and hear your favorite music in a brand new light.",
    "size": 95,
    "reviews": 92000,
    "ratingAvg": 4.3,
    "downloads": 15000000,
    "ratings": [
      { "name": "1 star", "count": 3000 },
      { "name": "2 star", "count": 4500 },
      { "name": "3 star", "count": 10000 },
      { "name": "4 star", "count": 28000 },
      { "name": "5 star", "count": 46500 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/sJ1CSwft/coconut-tree.png",
    "title": "Creative Sketchpad",
    "companyName": "Artistic Apps Co.",
    "id": 117,
    "description": "Unleash your artistic vision anywhere with **Creative Sketchpad**, the comprehensive digital drawing and painting app for mobile devices and tablets. Designed to serve both professional artists and casual doodlers, the app offers a massive suite of features that rival desktop software. Explore our extensive library of **over 300 customizable brushes**, including highly realistic replicates of watercolor, oil paint, charcoal, and technical pens. The advanced layering system allows for non-destructive editing, with blend modes and opacity controls for perfect composition. Key productivity features include **automatic stroke stabilization** for smoother lines, a customizable color picker, and symmetry drawing tools for complex patterns. For illustration work, the app provides tools for vector-based drawing and precise shape creation. Artists can record their entire creative process with the built-in **Time-Lapse Replay** feature, perfect for sharing on social media. The interface is highly intuitive and fully customizable, allowing you to position toolbars exactly where you need them. **Creative Sketchpad** supports high-resolution canvases and allows you to import and export files in popular formats like PSD (Photoshop), PNG, and JPEG. Join our thriving community of over **1.3 million digital artists** who use the app daily to turn their inspiration into reality. Download today and find the perfect digital canvas for your next masterpiece.",
    "size": 160,
    "reviews": 28500,
    "ratingAvg": 4.6,
    "downloads": 1300000,
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1750 },
      { "name": "4 star", "count": 7000 },
      { "name": "5 star", "count": 19000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/sJ1CSwft/coconut-tree.png",
    "title": "Daily News Digest",
    "companyName": "InfoFeed Media",
    "id": 118,
    "description": "Stay informed, not overwhelmed, with **Daily News Digest**, your personalized, unbiased news aggregator. This app collects top stories from thousands of trusted global sources, delivering a concise, curated feed tailored specifically to your interests. Say goodbye to endless scrolling; our proprietary **AI engine** analyzes articles and summarizes key points, ensuring you grasp the core facts of any story in minutes. You control your feed by following specific topics (e.g., Technology, Global Markets, Climate Change, Sports) and blocking sources you don't trust. We prioritize diverse viewpoints, presenting side-by-side coverage from multiple reputable news organizations to provide a balanced perspective on complex issues. Key features include **Offline Reading Mode** to download your morning digest before your commute, customizable alerts for breaking news in your selected regions, and integrated video and podcast content for multimedia consumption. The app is dedicated to providing a clutter-free reading experience, minimizing distracting pop-ups and third-party ads. **Daily News Digest** is your essential tool for efficient and intelligent current affairs consumption. Join over **950,000 discerning readers** who use the app daily to stay informed about the world without the noise. Download now and start your day with clarity and context.",
    "size": 40,
    "reviews": 14000,
    "ratingAvg": 4.4,
    "downloads": 950000,
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 1600 },
      { "name": "4 star", "count": 4000 },
      { "name": "5 star", "count": 8000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/sJ1CSwft/coconut-tree.png",
    "title": "Realm of Magic RPG",
    "companyName": "FantasyQuest Games",
    "id": 119,
    "description": "Embark on an epic journey in **Realm of Magic RPG**, a breathtaking open-world fantasy role-playing game that spans a continent shrouded in ancient mystery. As a new hero emerging from the wilderness, you are free to explore a massive, seamless environment filled with dynamic characters, hidden dungeons, and colossal monsters. The game features a deep, non-linear storyline where your choices directly influence the fate of the realm and unlock multiple unique questlines and endings. Character progression is highly flexible with a **classless system**, allowing you to combine hundreds of spells, combat abilities, and crafting skills to create a truly unique hero build. Engage in strategic, turn-based combat that requires tactical planning and mastery of elemental magic. Discover forgotten artifacts, craft legendary weapons, and tame mythical creatures to serve as your mounts and companions. The world is populated by a myriad of factions—from noble knights to shadowy mages—each with their own complex political agendas. Choose your allegiance carefully, or carve out your own independent destiny. With stunning 3D graphics, a full orchestral score, and hundreds of hours of immersive content, **Realm of Magic RPG** offers the most expansive and rewarding mobile RPG experience to date. Join over **3.8 million adventurers** and begin forging your own legend today.",
    "size": 980,
    "reviews": 85000,
    "ratingAvg": 4.5,
    "downloads": 3800000,
    "ratings": [
      { "name": "1 star", "count": 1500 },
      { "name": "2 star", "count": 3000 },
      { "name": "3 star", "count": 7000 },
      { "name": "4 star", "count": 25000 },
      { "name": "5 star", "count": 48500 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/sJ1CSwft/coconut-tree.png",
    "title": "Task Master Go",
    "companyName": "WorkFlow Solutions",
    "id": 120,
    "description": "Boost your productivity and reclaim control of your day with **Task Master Go**, the definitive to-do list and task management application. Designed for speed and efficiency, this app simplifies the process of capturing, organizing, and executing everything on your plate, from small errands to complex projects. Easily create new tasks using **Natural Language Input (NLI)**—just type, 'Call dentist tomorrow at 2 PM,' and the app automatically sets the due date and reminder. Organize your tasks using flexible methods like projects, tags, priority levels, and custom filters. The powerful **Smart Scheduler** uses AI to suggest optimal times for tackling your most important tasks based on your availability, helping you prioritize effectively and avoid burnout. Seamless integration with your mobile calendar ensures all your commitments are visible in one place. Key features include recurring tasks, location-based reminders (e.g., reminding you to buy milk when you arrive at the grocery store), and the ability to share task lists for effortless team collaboration. **Task Master Go** provides detailed progress statistics, allowing you to visualize your productivity over time and maintain high motivation. Join the ranks of over **1.8 million organized professionals** who rely on Task Master Go to keep their work and personal lives running smoothly. Download now and start doing more of what matters.",
    "size": 35,
    "reviews": 25000,
    "ratingAvg": 4.7,
    "downloads": 1800000,
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 200 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 6700 },
      { "name": "5 star", "count": 17000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/sJ1CSwft/coconut-tree.png",
    "title": "Speed Racer 3D",
    "companyName": "Adrenaline Games",
    "id": 121,
    "description": "Experience the ultimate thrill of high-speed arcade racing with **Speed Racer 3D**, the game that pushes the limits of mobile adrenaline. Forget complex simulators—this is pure, heart-pounding action designed for instant fun. Race across highly detailed, dynamic tracks set in dazzling global locations, from neon-lit city streets to sun-drenched coastal highways. Choose from a garage of **dozens of customizable, high-performance sports cars**, each with unique handling and upgrade paths. The core gameplay features intuitive, responsive controls and spectacular physics, emphasizing high-octane drifts, jaw-dropping stunts, and strategic use of nitro boosts to leave your rivals in the dust. Compete in multiple thrilling modes: **Career Mode** to unlock new cars and circuits, **Time Trial** to master your lap times, and intense **PvP Multiplayer** against players from around the world. The stunning, console-quality 3D graphics and immersive sound design make every race feel visceral and real. **Speed Racer 3D** is constantly updated with new cars, tracks, and seasonal challenges, ensuring the racing never stops. Join over **6.5 million speed demons** in the most downloaded arcade racer on mobile. Download now, put the pedal to the metal, and prove you have what it takes to be the fastest racer on the asphalt!",
    "size": 350,
    "reviews": 70000,
    "ratingAvg": 4.1,
    "downloads": 6500000,
    "ratings": [
      { "name": "1 star", "count": 4000 },
      { "name": "2 star", "count": 6000 },
      { "name": "3 star", "count": 12000 },
      { "name": "4 star", "count": 20000 },
      { "name": "5 star", "count": 28000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/sJ1CSwft/coconut-tree.png",
    "title": "Universal Dictionary",
    "companyName": "WordSmith Tools",
    "id": 122,
    "description": "Unlock the full power of language with **Universal Dictionary**, the essential, comprehensive reference tool for students, writers, and language learners. This powerful app combines a world-class dictionary, a robust thesaurus, and an advanced translation engine into one fast, intuitive interface. Our core database includes **over 250,000 words** with detailed definitions, etymologies, usage examples, and real-time pronunciation audio provided by native speakers. The integrated **Thesaurus** provides synonyms, antonyms, and related words to dramatically enhance your vocabulary and writing style. A standout feature is the **Instant Translator**, which allows you to translate single words or entire phrases between over 50 languages. Simply type, speak, or even snap a picture of text, and get instant, accurate results. For students, the app includes a powerful **Vocabulary Builder** that uses personalized quizzes and flashcards to help you master challenging words. All content, including core definitions and translations, is accessible **offline**, making it the perfect tool for travel or areas with limited connectivity. Customize your experience by saving favorite words, creating personalized learning lists, and using the word-of-the-day feature to expand your knowledge effortlessly. Join over **4 million global users** who rely on **Universal Dictionary** for accurate, instant, and comprehensive language assistance. Download today and become a master of words.",
    "size": 150,
    "reviews": 31000,
    "ratingAvg": 4.6,
    "downloads": 4000000,
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 9000 },
      { "name": "5 star", "count": 19500 }
    ]
  }
]